Revit 2017 API
ShapeImporter Properties
The ShapeImporter type exposes the following members.
Properties
Name | Description
InputFormat
 The format of the incoming data.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace